# Core
brew "fish"
brew "tmux"
brew "neovim"
brew "starship"
brew "git"

# Tools
brew "fzf"
brew "ripgrep"
brew "fd"
brew "just"
brew "lazygit"
brew "python"

# Languages & Runtimes
brew "rustup"
brew "node@22"

# Cloud & Infra
brew "awscli"
brew "kubectl"
